---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureDefinition
source: html/e5619e13-6cf3-6507-e77b-72f4506eb573.htm
---
# FailureDefinition Properties

Specifies whether the .NET object represents a valid Revit entity.